Revit 2026 API

# DatumPlaneCanBeVisibleInView Method

---

Checks if the datum plane can be visible in the view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanBeVisibleInView(
	View view
)
```
```vb
Public Function CanBeVisibleInView (
	view As View
) As Boolean
```
```cpp
public:
bool CanBeVisibleInView(
	View^ view
)
```
```fsharp
member CanBeVisibleInView :
        view : View -> bool
```

#### Parameters

view View
     The view.

#### Return Value

Boolean True if visible, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

This method determines if the orientation of the DatumPlane and View allows that the DatumPlane can be seen in the indicated view. It does not actually determine if the DatumPlane is visible, as many factors can affect the visibility of an element in a given view (for example, hiding the element).

#### Reference

DatumPlane Class

Autodesk.Revit.DB Namespace